const { Telegraf, Markup } = require('telegraf');
const bot = new Telegraf(process.env.BOT_TOKEN);

bot.start((ctx) => {
  ctx.reply(`
🎬 আমাদের অফিসিয়াল Bot-এ স্বাগতম!

🚀 এখানে আপনি পাবেন:
• এক্সক্লুসিভ ভাইরাল ভিডিও 🔥
• সহজ ইউজার ইন্টারফেস 🧩
• দ্রুত ওয়েবঅ্যাপ অ্যাক্সেস ⚡

👇 নিচের বোতামগুলো থেকে যেকোনোটি বেছে নিন 👇
`, Markup.inlineKeyboard([
    [Markup.button.url('🎥 রাত্রির ভাইরাল ভিডিও', '
https://t.me/+9tdyc3jXlFtiYWE1')],
    [Markup.button.url('🎥 অইথয় ভাইরাল ভিডিও', 'https://t.me/+2u3YJ0yBOH9lY2M1')],
    [Markup.button.url('🎥 ইরা মনির ভাইরাল ভিডিও', 'https://t.me/+07HnXSrDmVo5ZWU1')],
    [Markup.button.url('🎥 বাংলাদেশী ভাইরাল ভিডিও', 'https://t.me/+6rozd6KAsqszZWM9')],
    [Markup.button.url('🎥 বাচ্চাদের ভাইরাল ভিডিও', 'https://t.me/+Ujw8fuMefmdjZjg1')]
  ]));
});

bot.launch();
console.log('✅ Bot is running...');
