const { Telegraf, Markup } = require('telegraf');
const bot = new Telegraf(process.env.8581302436:AAGC1S-E0NMgr5MiJfJmPArJyEzX-jLh8uk);

bot.start((ctx) => {
  ctx.reply(`
🎬 আমাদের অফিসিয়াল Bot-এ স্বাগতম!

🚀 এখানে আপনি পাবেন:
• এক্সক্লুসিভ ভাইরাল ভিডিও 🔥
• সহজ ইউজার ইন্টারফেস 🧩
• দ্রুত ওয়েবঅ্যাপ অ্যাক্সেস ⚡

👇 নিচের বোতামগুলো থেকে যেকোনোটি বেছে নিন 👇
`, Markup.inlineKeyboard([
    [Markup.button.url('🎥 রাত্রির ভাইরাল ভিডিও', 'https://t.me/+B6sIasJMYMk0ZTE9')],
    [Markup.button.url('🎥 অইথয় ভাইরাল ভিডিও', 'https://t.me/+MhOW1XlGFINjMmY1')],
    [Markup.button.url('🎥 ইরা মনির ভাইরাল ভিডিও', 'https://t.me/+EzxxVJAknrc4ODA1')],
    [Markup.button.url('🎥 বাংলাদেশী ভাইরাল ভিডিও', 'https://t.me/+c9riYMlF8YUzZjg1')],
    [Markup.button.url('🎥 বাচ্চাদের ভাইরাল ভিডিও', 'https://t.me/+9Tx_0c4YYqM5OWJl')]
  ]));
});

bot.launch();
console.log('✅ Bot is running...');
